CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
#include <stm32f1xx_hal.h>
#include <string.h>
#include <stdbool.h>
#include <assert.h>

#include "nds_cart.h"
#include "util.h"

/*
 * Wiring:
 * PORTC[0..7]  <-> NDS_DATA[0..7]
 * PORTC[8]     <-> NDS_CLK
 * PORTC[9]     <-> NDS_ROMCS
 * PORTC[10]    <-> NDS_RESET
 * PORTC[11]    <-> NDS_EEPROMCS
 *
 * On all transfers, data should be stable at rising edge of CLK
 */

#define PIN_CLK 8u
#define PIN_CLK_MSK (1u << PIN_CLK)
#define PIN_ROMCS 9u
#define PIN_ROMCS_MSK (1u << PIN_ROMCS)
#define PIN_RESET 10u
#define PIN_RESET_MSK (1u << PIN_RESET)
#define PIN_EEPROMCS 11u
#define PIN_EEPROMCS_MSK (1u << PIN_EEPROMCS)

#define NDS_PAGE_SIZE 0x1000
#define NDS_CHUNK_SIZE 0x200
#define NDS_SMALL_HEADER_SIZE 0x200
#define NDS_EXT_HEADER_SIZE 0x1000

__attribute__((always_inline)) static inline void wait_cycles(size_t cycles) {
#pragma GCC unroll 64
    for (size_t i = 0; i < cycles; i++) {
        __asm__ volatile("nop");
    }
}

static void print_chip_id(const struct nds_chip_id *id)
{
    uint8_t bid[4];
    memcpy(bid, id, 4);
    uart_printf("chip_id: %02x %02x %02x %02x\r\n", bid[0], bid[1], bid[2], bid[3]);
}

__attribute__((always_inline)) static inline void clk_low(void)
{
    GPIOC->BSRR = PIN_CLK_MSK << 16;
}

__attribute__((always_inline)) static inline void clk_high(void)
{
    GPIOC->BSRR = PIN_CLK_MSK;
}

__attribute__((always_inline)) static inline void romcs_low(void)
{
    GPIOC->BSRR = PIN_ROMCS_MSK << 16;
}

__attribute__((always_inline)) static inline void romcs_high(void)
{
    GPIOC->BSRR = PIN_ROMCS_MSK;
}

__attribute__((always_inline)) static inline void reset_low(void)
{
    GPIOC->BSRR = PIN_RESET_MSK << 16;
}

__attribute__((always_inline)) static inline void reset_high(void)
{
    GPIOC->BSRR = PIN_RESET_MSK;
}

__attribute__((always_inline)) static inline void eepromcs_low(void)
{
    GPIOC->BSRR = PIN_EEPROMCS_MSK << 16;
}

__attribute__((always_inline)) static inline void eepromcs_high(void)
{
    GPIOC->BSRR = PIN_EEPROMCS_MSK;
}

__attribute__((always_inline)) static inline void data_dir_input(void)
{
    GPIOC->CRL = 0x44444444;
}

__attribute__((always_inline)) static inline uint8_t data_input(void)
{
    return (uint8_t)GPIOC->IDR;
}

__attribute__((always_inline)) static inline void data_dir_output()
{
    GPIOC->CRL = 0x11111111;
}

__attribute__((always_inline)) static inline void data_output(uint8_t v)
{
    uint8_t nv = (uint8_t)~v;
    GPIOC->BSRR = (uint32_t)(v | (nv << 16));
}

__attribute__((always_inline)) static inline uint8_t data_in_cycle(size_t cycles)
{
    clk_low();
    wait_cycles(cycles);
    uint8_t ret = data_input();
    clk_high();
    wait_cycles(cycles);
    return ret;
}

__attribute__((always_inline)) static inline void data_out_cycle(uint8_t d, size_t cycles)
{
    clk_low();
    data_output(d);
    wait_cycles(cycles);
    clk_high();
    wait_cycles(cycles);
}

__attribute__((always_inline)) static inline uint8_t data_in_cycle_42(void)
{
    return data_in_cycle(8);
}

__attribute__((always_inline)) static inline uint8_t data_in_cycle_67(void)
{
    return data_in_cycle(5);;
}

__attribute__((always_inline)) static inline void data_out_cycle_42(uint8_t d)
{
    data_out_cycle(d, 8);
}

__attribute__((always_inline)) static inline void data_out_cycle_67(uint8_t d)
{
    data_out_cycle(d, 5);
}

static void nds_cart_exec_command(uint64_t cmd, uint8_t *data, size_t len);

static void nds_cart_cmd_dummy(void);
static void nds_cart_cmd_main_data_read(uint8_t *data, uint32_t addr);
static void nds_cart_cmd_enable_key1_nds(void);
static void nds_cart_cmd_enable_key2(void);
static void nds_cart_cmd_chip_id_key1(struct nds_chip_id *chip_id);
//static void nds_cart_cmd_invalid(uint8_t *data, size_t len);
static void nds_cart_cmd_get_secure_area(uint8_t *data, size_t page);
static void nds_cart_cmd_chip_id_key2(struct nds_chip_id *chip_id);
static void nds_cart_cmd_enable_data_mode(void);

static void nds_cart_read_header(uint8_t *data, bool extended);
static void nds_cart_read_main_data_page(uint8_t *data, size_t page);
static void nds_cart_read_secure_area_page(uint8_t *data, size_t page);

static void key1_init_keycode(uint32_t idcode, uint32_t level, uint32_t modulo, bool dsi);
static void key1_encrypt_64bit(uint32_t *data);
static void key1_decrypt_64bit(uint32_t *data);
static uint64_t key1_encrypt_cmd(uint64_t cmd);
static uint64_t key1_decrypt_cmd(uint64_t cmd);

static void key2_init(bool hw_reset);
static void key2_xcrypt(uint8_t *data, size_t len);
static uint64_t key2_encrypt_cmd(uint64_t cmd);

enum nds_cart_state_t {
    NDS_CART_UNINITIALIZED,
    NDS_CART_RAW,
    NDS_CART_KEY1,
    NDS_CART_KEY2,
};

enum nds_proto_rev {
    NDS_PROTO_REV_MROM,
    NDS_PROTO_REV_1TROM_NAND,
};

enum nds_cart_clk_rate {
    NDS_CART_CLK_6P7_MHZ,
    NDS_CART_CLK_4P2_MHZ,
};

static struct {
    uint8_t state;
    bool normal_gap_clk : 1;
    bool key1_gap_clk : 1;
    bool normal_clk_rate : 1;
    bool key1_clk_rate : 1;
    bool nds : 1;
    bool dsi : 1;
    bool has_secure_area : 1;
    bool protocol_rev : 1;
    uint8_t normal_gap2;
    uint8_t key1_gap2;
    uint16_t normal_gap1;
    uint16_t key1_gap1;
    uint16_t key1_delay_ms;
    // header data
    uint32_t game_code;
    uint32_t secure_area_disable[2];
    uint8_t seed_byte;
    // other data
    struct nds_chip_id chip_id;
    // encryption stuff
    uint32_t kkkkk;
    uint16_t iii, jjj, llll;
    uint16_t mmm, nnn;
    uint64_t key2_x;
    uint64_t key2_y;
} nds_cart_state;

/*
 * Init's all required GPIO's to access the ROM cartridge and Flash/EEPROM
 */

static void nds_cart_reset(void)
{
    reset_low();
    HAL_Delay(10);
    reset_high();

    nds_cart_state.state = NDS_CART_UNINITIALIZED;
    nds_cart_state.normal_gap_clk = false;
    nds_cart_state.key1_gap_clk = false;
    nds_cart_state.normal_clk_rate = false;
    nds_cart_state.key1_clk_rate = false;
    nds_cart_state.nds = true;
    nds_cart_state.dsi = false;
    nds_cart_state.has_secure_area = true;
    // gaps below add up to GBATEK's 0x910 gap
    nds_cart_state.normal_gap1 = 0x8F8;
    nds_cart_state.key1_gap1 = 0x8F8;
    nds_cart_state.normal_gap2 = 0x18;
    nds_cart_state.key1_gap2 = 0x18;
}

static void nds_cart_begin_key1(void)
{
    // init blowfish for secure area loading
    myassert(nds_cart_state.state == NDS_CART_RAW, "cart must be in raw mode before beginning key1\r\n", NULL);

    uint32_t secure_area_disable[2] = {
        nds_cart_state.secure_area_disable[0], nds_cart_state.secure_area_disable[1]
    };

    // TODO first two of these commands can probably be removed
    key1_init_keycode(nds_cart_state.game_code, 1, 8, false);
    key1_decrypt_64bit(secure_area_disable);
    key1_init_keycode(nds_cart_state.game_code, 2, 8, false);

    // send key1 init command
    nds_cart_cmd_enable_key1_nds();

