CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
    // encrypt subsequent commands with key1 algo
    nds_cart_state.state = NDS_CART_KEY1;

    // key1 state has key2 encrypted results, so init this as well
    nds_cart_cmd_enable_key2();

    // check key2 stream
//    uint8_t key2_stream_data[4];
//    nds_cart_cmd_invalid(key2_stream_data, sizeof(key2_stream_data));
//    uart_print_bytes(key2_stream_data, sizeof(key2_stream_data));

    // check chip_id
    struct nds_chip_id chip_id;
    nds_cart_cmd_chip_id_key1(&chip_id);

    if (memcmp(&chip_id, &nds_cart_state.chip_id, sizeof(chip_id))) {
        DEBUG_PRINT("chip_id with key1 cmd doesn't match initial chip_id:\r\n");
        print_chip_id(&chip_id);
    } else {
//        DEBUG_PRINT("key1 chip_id is correct!\r\n");
    }
}

static void nds_cart_begin_key2(void)
{
    // init xor cipher for main data transfer
    myassert(nds_cart_state.state == NDS_CART_KEY1, "cart must be in key1 mode before beginning key2\r\n", NULL);

    nds_cart_cmd_enable_data_mode();

    nds_cart_state.state = NDS_CART_KEY2;

    // check chip_id
    struct nds_chip_id chip_id;
    nds_cart_cmd_chip_id_key2(&chip_id);

    if (memcmp(&chip_id, &nds_cart_state.chip_id, sizeof(chip_id))) {
        DEBUG_PRINT("chip_id with key2 cmd doesn't match initial chip_id:\r\n");
        print_chip_id(&chip_id);
    } else {
//        DEBUG_PRINT("key1 chip_id is correct!\r\n");
    }
}

void nds_cart_init(void)
{
    // set port C[0..7] to High-Z
    data_dir_input();
    // set port C[8..11] to Output
    clk_high();
    romcs_high();
    reset_high();
    eepromcs_high();
    MODIFY_REG(GPIOC->CRH, 0xFFFFu, 0x1111u);

    nds_cart_reset();
}

static void nds_cart_change_state(uint8_t state)
{
    if (state == NDS_CART_UNINITIALIZED) {
        nds_cart_reset();
    } else if (state == NDS_CART_RAW && nds_cart_state.state != NDS_CART_RAW) {
        nds_cart_rom_init();
        assert(nds_cart_state.state == NDS_CART_RAW);
    } else if (state == NDS_CART_KEY1 && nds_cart_state.state != NDS_CART_KEY1) {
        nds_cart_rom_init();
        nds_cart_begin_key1();
        assert(nds_cart_state.state == NDS_CART_KEY1);
    } else if (state == NDS_CART_KEY2 && nds_cart_state.state != NDS_CART_KEY2) {
        nds_cart_rom_init();
        nds_cart_begin_key1();
        nds_cart_begin_key2();
        assert(nds_cart_state.state == NDS_CART_KEY2);
    } else if (state == nds_cart_state.state) {
        return;
    } else {
        myassert(false, "switching to invalid state: 0x%x\r\n", (uint32_t)state);
    }
}

static void nds_cart_exec_command(uint64_t org_cmd, uint8_t *data, size_t len)
{
    assert(data != NULL);

    romcs_low();
    data_dir_output();

    bool clk_rate;
    bool gap_clk;
    bool key2_result;
    size_t gap1;
    size_t gap2;
//    const char *cmd_key = "RAW";
    uint64_t cmd;

    if (nds_cart_state.state == NDS_CART_KEY1) {
        clk_rate = nds_cart_state.key1_clk_rate;
        gap_clk = nds_cart_state.key1_gap_clk;
        gap1 = nds_cart_state.key1_gap1 + nds_cart_state.key1_gap2;
        gap2 = nds_cart_state.key1_gap2;

        cmd = key1_encrypt_cmd(org_cmd);
        key2_result = true;
//        cmd_key = "KEY1";
    } else {
        clk_rate = nds_cart_state.normal_clk_rate;
        gap_clk = nds_cart_state.normal_gap_clk;
        gap1 = nds_cart_state.normal_gap1 + nds_cart_state.normal_gap2;
        gap2 = nds_cart_state.normal_gap2;

        if (nds_cart_state.state == NDS_CART_KEY2) {
            cmd = key2_encrypt_cmd(org_cmd);
//            cmd_key = "KEY2";
            key2_result = true;
        } else {
            cmd = org_cmd;
            key2_result = false;
        }
    }

//    DEBUG_PRINTF("org_cmd: [%016llx] enc_cmd=[%016llx] clk=%s gap_clk=%d gap1=%u gap2=%u cmd_crypt=%s reply_crypt=%s\r\n",
//            org_cmd,
//            cmd,
//            clk_rate == NDS_CART_CLK_6P7_MHZ ? "6.7 Mhz" : "4.2 MHz",
//            gap_clk,
//            gap1,
//            gap2,
//            cmd_key,
//            key2_result ? "KEY2" : "RAW"
//            );

    const uint8_t cmd_data[8] = {
        (uint8_t)(cmd >> 56), (uint8_t)(cmd >> 48), (uint8_t)(cmd >> 40), (uint8_t)(cmd >> 32),
        (uint8_t)(cmd >> 24), (uint8_t)(cmd >> 16), (uint8_t)(cmd >> 8),  (uint8_t)(cmd >> 0),
    };

    /* 1. output command */
    if (clk_rate == NDS_CART_CLK_6P7_MHZ) {
        for (size_t i = 0; i < 8; i++) {
            data_out_cycle_67(cmd_data[i]);
        }
    } else {
        for (size_t i = 0; i < 8; i++) {
            data_out_cycle_42(cmd_data[i]);
        }
    }

    data_dir_input();

    /* 2. wait gap 1 (which includes locally computed cycles of gap2) */
    if (gap_clk) {
        if (clk_rate == NDS_CART_CLK_6P7_MHZ) {
            for (size_t i = 0; i < gap1; i++)
                (void)data_in_cycle_67();
        } else {
            for (size_t i = 0; i < gap1; i++)
                (void)data_in_cycle_42();
        }

        if (key2_result)
            key2_xcrypt(NULL, gap1);
    } else {
        WAIT(gap1 * 12);
    }

    if (len == 0)
        goto cmdend;

    /* 3. read result data in chunks of NDS_CHUNK_SIZE */
    while (true) {
        size_t block_size = len;
        if (block_size > NDS_CHUNK_SIZE)
            block_size = NDS_CHUNK_SIZE;

        /* 3.1. read data */
        if (clk_rate == NDS_CART_CLK_6P7_MHZ) {
            for (size_t i = 0; i < block_size; i++)
                data[i] = data_in_cycle_67();
        } else {
            for (size_t i = 0; i < block_size; i++)
                data[i] = data_in_cycle_42();
        }

        if (key2_result)
            key2_xcrypt(data, block_size);

        data += block_size;
        len -= block_size;

        if (len == 0)
            break;

        /* 3.2. wait gap 2 */
        if (gap_clk) {
            if (clk_rate == NDS_CART_CLK_6P7_MHZ) {
                for (size_t i = 0; i < gap2; i++)
                    (void)data_in_cycle_67();
            } else {
                for (size_t i = 0; i < gap2; i++)
                    (void)data_in_cycle_42();
            }

            if (key2_result)
                key2_xcrypt(NULL, gap2);
        } else {
            WAIT(gap2 * 12);
        }
    }

cmdend:
    data_dir_input();
    romcs_high();
    WAIT(10);
}

static void nds_cart_cmd_dummy(void)
{
    const uint64_t cmd = 0x9F00000000000000;
    uint8_t dummy_data[0x2000];
    nds_cart_exec_command(cmd, dummy_data, sizeof(dummy_data));
}

static void nds_cart_rom_read_page(uint8_t *read_buffer, size_t page_addr)
{
//    DEBUG_PRINTF("read_page=%x\r\n", page_addr);

