CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
    page_addr &= ~0xFFFu;

    if (page_addr == 0) {
        // read header
        nds_cart_change_state(NDS_CART_RAW);
        if (nds_cart_state.dsi) {
            nds_cart_read_header(read_buffer, true);
            memset(&read_buffer[NDS_SMALL_HEADER_SIZE], 0, NDS_PAGE_SIZE - NDS_EXT_HEADER_SIZE);
        } else {
            nds_cart_read_header(read_buffer, false);
            memset(&read_buffer[NDS_SMALL_HEADER_SIZE], 0, NDS_PAGE_SIZE - NDS_SMALL_HEADER_SIZE);
        }
    } else if (page_addr < 0x4000) {
        // read unused area
        memset(read_buffer, 0, NDS_PAGE_SIZE);
    } else if (page_addr < 0x8000) {
        // read secure area
        if (nds_cart_state.has_secure_area) {
            nds_cart_change_state(NDS_CART_KEY1);
            nds_cart_read_secure_area_page(read_buffer, page_addr >> 12);
        } else {
            memset(read_buffer, 0, NDS_PAGE_SIZE);
        }
    } else {
        // read data
        nds_cart_change_state(NDS_CART_KEY2);
        nds_cart_read_main_data_page(read_buffer, page_addr >> 12);
    }

    // TODO read DSi secure area
}

void nds_cart_rom_read(size_t byte_addr, uint8_t *data, size_t len)
{
    uint8_t read_buffer[NDS_PAGE_SIZE];

    while (len > 0) {
        size_t page_addr = byte_addr & ~0xFFFu;
        size_t page_index = byte_addr & 0xFFFu;

        size_t read_len = NDS_PAGE_SIZE - page_index;
        if (read_len > len)
            read_len = len;

        nds_cart_rom_read_page(read_buffer, page_addr);
        memcpy(data, &read_buffer[page_index], read_len);
        byte_addr += read_len;
        len -= read_len;
        data += read_len;
    }
}

bool nds_cart_rom_init(void)
{
    nds_cart_reset();

    HAL_Delay(10);

    struct nds_chip_id chip_id;
    struct nds_header header;

    nds_cart_state.state = NDS_CART_RAW;

    nds_cart_cmd_dummy();
    nds_cart_read_header((uint8_t *)&header, false);
    nds_cart_cmd_chip_id((uint8_t *)&chip_id);

    nds_cart_state.chip_id = chip_id;
    nds_cart_state.protocol_rev = chip_id.cart_protocol;
//    DEBUG_PRINTF("protocol_rev: %d\r\n", nds_cart_state.protocol_rev);
//    print_chip_id(&chip_id);
    nds_cart_state.normal_gap_clk = header.gamecart_bus_timing_normal.clk_gap;
    nds_cart_state.normal_clk_rate = header.gamecart_bus_timing_normal.clk_rate;
    nds_cart_state.normal_gap1 = header.gamecart_bus_timing_normal.gap1_len;
    nds_cart_state.normal_gap2 = header.gamecart_bus_timing_normal.gap2_len;
    nds_cart_state.key1_gap_clk = chip_id.cart_protocol == 0 ? true : false;
    nds_cart_state.key1_clk_rate = header.gamecart_bus_timing_key1.clk_rate;
    nds_cart_state.key1_gap1 = header.gamecart_bus_timing_key1.gap1_len;
    nds_cart_state.key1_gap2 = header.gamecart_bus_timing_key1.gap2_len;
    nds_cart_state.key1_delay_ms = (uint16_t)ceil_div(header.secure_area_delay * 1000, 131072);
//    DEBUG_PRINTF("secure_area_delay ms: %u\r\n", nds_cart_state.key1_delay_ms);

    if (header.unit_code == 0x0) {
        nds_cart_state.nds = true;
        nds_cart_state.dsi = false;
    } else if (header.unit_code == 0x2) {
        nds_cart_state.nds = true;
        nds_cart_state.dsi = true;
    } else if (header.unit_code == 0x3) {
        nds_cart_state.nds = false;
        nds_cart_state.dsi = true;
    } else {
        DEBUG_PRINTF("NDS cart: illegal unit code: %02x", header.unit_code);
        return false;
    }

    if (header.arm9_rom_offset >= 0x8000)
        nds_cart_state.has_secure_area = false;
    else
        nds_cart_state.has_secure_area = true;

    nds_cart_state.game_code = header.game_code_uint;
    nds_cart_state.secure_area_disable[0] = header.secure_area_disable_uint[0];
    nds_cart_state.secure_area_disable[1] = header.secure_area_disable_uint[1];
    nds_cart_state.seed_byte = header.encryption_seed_select;

    // TODO randomize these initial values for hardened testing
    nds_cart_state.kkkkk = 0x98bc7;
    nds_cart_state.iii = 0x20C;
    nds_cart_state.jjj = 0xB5B;
    nds_cart_state.llll = 0xd44e;
    nds_cart_state.mmm = 0x733;
    nds_cart_state.nnn = 0xc55;
    key2_init(true);
//    uint8_t d[8];
//    memset(d, 0, sizeof(d));
//    key2_xcrypt(d, sizeof(d));
//    DEBUG_PRINT("key2_hw_init_stream:\r\n");
//    uart_print_bytes(d, sizeof(d));
    return true;
}

/*
 * RAW (unencrypted) commands
 */

static void nds_cart_read_header(uint8_t *data, bool extended)
{
    assert(nds_cart_state.state == NDS_CART_RAW);

    uint64_t cmd = 0x0000000000000000;

    if (extended) {
        if (nds_cart_state.protocol_rev == NDS_PROTO_REV_1TROM_NAND) {
            for (size_t chunk = 0; chunk < NDS_EXT_HEADER_SIZE / NDS_CHUNK_SIZE; chunk++) {
                size_t chunk_addr = chunk * NDS_CHUNK_SIZE;
                /* 0x00aaaaaaaa000000 */
                cmd |= (uint64_t)chunk_addr << 24;
                nds_cart_exec_command(cmd, &data[chunk_addr], NDS_CHUNK_SIZE);
            }
        } else {
            nds_cart_exec_command(cmd, data, NDS_EXT_HEADER_SIZE);
        }
    } else {
        nds_cart_exec_command(cmd, data, NDS_SMALL_HEADER_SIZE);
        for (size_t i = NDS_SMALL_HEADER_SIZE; i < NDS_EXT_HEADER_SIZE; i++)
            data[i] = 0;
    }
}

void nds_cart_cmd_chip_id(uint8_t data[4])
{
    assert(nds_cart_state.state == NDS_CART_RAW);

    const uint64_t cmd = 0x9000000000000000;

    nds_cart_exec_command(cmd, data, 4);
}

static void nds_cart_cmd_main_data_read(uint8_t *data, uint32_t addr)
{
    uint64_t cmd = 0xB700000000000000;
    cmd |= ((uint64_t)addr & 0xFFFFFFFF) << 24;

    nds_cart_exec_command(cmd, data, NDS_CHUNK_SIZE);
}

static void nds_cart_cmd_enable_key1_nds(void)
{
    uint8_t reply[1];
    uint64_t cmd = 0x3C00000000000000;
    cmd |= (uint64_t)(nds_cart_state.iii & 0xFFF) << 44;
    cmd |= (uint64_t)(nds_cart_state.jjj & 0xFFF) << 32;
    cmd |= (uint64_t)(nds_cart_state.kkkkk & 0xFFFFF) << 8;
    nds_cart_exec_command(cmd, reply, 0);
}

/*
 * KEY1 (encrypted) commands
 */

static void nds_cart_cmd_enable_key2(void)
{
    assert(nds_cart_state.state == NDS_CART_KEY1);

