CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
    uint8_t reply[1];
    uint64_t cmd = 0x4000000000000000;
    cmd |= (uint64_t)(nds_cart_state.llll & 0xFFFF) << 44;
    cmd |= (uint64_t)(nds_cart_state.mmm & 0xFFF) << 32;
    cmd |= (uint64_t)(nds_cart_state.nnn & 0xFFF) << 20;
    cmd |= (uint64_t)(nds_cart_state.kkkkk & 0xFFFFF) << 0;

    assert(cmd == key1_decrypt_cmd(key1_encrypt_cmd(cmd)));

//    uint64_t cmd_test_crypt = 0xff33aa411b5cadec;
//    DEBUG_PRINTF("traced [%016llx] decrypts to [%016llx]\r\n", cmd_test_crypt, key1_decrypt_cmd(cmd_test_crypt));

    if (nds_cart_state.protocol_rev == NDS_PROTO_REV_MROM) {
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, reply, 0);
        key2_init(false);
    } else {
        nds_cart_exec_command(cmd, reply, 0);
        HAL_Delay(nds_cart_state.key1_delay_ms);
        key2_init(false);
        nds_cart_exec_command(cmd, reply, 0);
    }

//    DEBUG_PRINTF("key2 stream beginning with: %02x\r\n", reply[0]);
    nds_cart_state.kkkkk += 1;
}

static void nds_cart_cmd_chip_id_key1(struct nds_chip_id *chip_id)
{
    assert(nds_cart_state.state == NDS_CART_KEY1);

    uint64_t cmd = 0x1000000000000000;
    cmd |= (uint64_t)(nds_cart_state.llll & 0xFFFF) << 44;
    cmd |= (uint64_t)(nds_cart_state.iii & 0xFFF) << 32;
    cmd |= (uint64_t)(nds_cart_state.jjj & 0xFFF) << 20;
    cmd |= (uint64_t)(nds_cart_state.kkkkk & 0xFFFFF) << 0;

    if (nds_cart_state.protocol_rev == NDS_PROTO_REV_MROM) {
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, (uint8_t *)chip_id, sizeof(*chip_id));
    } else {
        nds_cart_exec_command(cmd, (uint8_t *)chip_id, 0);
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, (uint8_t *)chip_id, sizeof(*chip_id));
    }

    nds_cart_state.kkkkk += 1;
}

//static void nds_cart_cmd_invalid(uint8_t *data, size_t len)
//{
//    assert(nds_cart_state.state == NDS_CART_KEY1);
//
//    const uint64_t cmd = 0x5000000000000000;
//    if (nds_cart_state.protocol_rev == NDS_PROTO_REV_MROM) {
//        HAL_Delay(nds_cart_state.key1_delay_ms);
//        nds_cart_exec_command(cmd, data, len);
//    } else {
//        nds_cart_exec_command(cmd, data, 0);
//        HAL_Delay(nds_cart_state.key1_delay_ms);
//        nds_cart_exec_command(cmd, data, len);
//    }
//}

static void nds_cart_cmd_get_secure_area(uint8_t *data, size_t page)
{
    assert(nds_cart_state.state == NDS_CART_KEY1);


    uint64_t cmd = 0x2000000000000000;
    cmd |= (uint64_t)(page & 0xFFFF) << 44;
    cmd |= (uint64_t)(nds_cart_state.iii & 0xFFF) << 32;
    cmd |= (uint64_t)(nds_cart_state.jjj & 0xFFF) << 20;
    cmd |= (uint64_t)(nds_cart_state.kkkkk & 0xFFFFF) << 0;

    if (nds_cart_state.protocol_rev == NDS_PROTO_REV_MROM) {
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, data, NDS_PAGE_SIZE);
    } else {
        nds_cart_exec_command(cmd, data, 0);
        HAL_Delay(nds_cart_state.key1_delay_ms);
        for (size_t i = 0; i < NDS_PAGE_SIZE / NDS_CHUNK_SIZE; i++) {
            nds_cart_exec_command(cmd, data, NDS_CHUNK_SIZE);
            data += NDS_CHUNK_SIZE;
        }
    }

    nds_cart_state.kkkkk += 1;
}

static void nds_cart_cmd_enable_data_mode(void)
{
    assert(nds_cart_state.state == NDS_CART_KEY1);

    uint8_t reply[1];
    uint64_t cmd = 0xA000000000000000;
    cmd |= (uint64_t)(nds_cart_state.llll & 0xFFFF) << 44;
    cmd |= (uint64_t)(nds_cart_state.iii & 0xFFF) << 32;
    cmd |= (uint64_t)(nds_cart_state.jjj & 0xFFF) << 20;
    cmd |= (uint64_t)(nds_cart_state.kkkkk & 0xFFFFF) << 0;

    if (nds_cart_state.protocol_rev == NDS_PROTO_REV_MROM) {
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, reply, 0);
    } else {
        nds_cart_exec_command(cmd, reply, 0);
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, reply, 0);
    }

    nds_cart_state.kkkkk += 1;
}

/*
 * KEY2 (encrypted) commands
 */

static void nds_cart_cmd_chip_id_key2(struct nds_chip_id *chip_id)
{
    assert(nds_cart_state.state == NDS_CART_KEY2);

    const uint64_t cmd = 0xB800000000000000;
    nds_cart_exec_command(cmd, (uint8_t *)chip_id, sizeof(*chip_id));
}

static void nds_cart_read_main_data_page(uint8_t *data, size_t page)
{
    assert(nds_cart_state.state == NDS_CART_KEY2);

    for (size_t chunk = 0; chunk < NDS_PAGE_SIZE / NDS_CHUNK_SIZE; chunk++) {
        uint32_t addr = (page << 12) + chunk * NDS_CHUNK_SIZE;
        nds_cart_cmd_main_data_read(data, addr);
        data += NDS_CHUNK_SIZE;
    }
}

/*
 * high level command functions
 */

static void nds_cart_read_secure_area_page(uint8_t *data, size_t page)
{
    // TODO secure are delay
    assert(nds_cart_state.state == NDS_CART_KEY1);
    assert(page >= 4 && page <= 7);

    union {
        uint8_t _u8[NDS_PAGE_SIZE];
        uint32_t _u32[NDS_PAGE_SIZE / 4];
    } secure_area_page;

    nds_cart_cmd_get_secure_area(secure_area_page._u8, page);

    if (page == 4) {
        key1_decrypt_64bit(&secure_area_page._u32[0]);
        key1_init_keycode(nds_cart_state.game_code, 3, 8, false);
        const size_t SEC_AREA_KEY1_CRYPT_LEN = 0x800;
        for (size_t i = 0; i < SEC_AREA_KEY1_CRYPT_LEN / sizeof(uint32_t); i += 2)
            key1_decrypt_64bit(&secure_area_page._u32[i]);

        if (memcmp(secure_area_page._u8, "encryObj", 8)) {
            DEBUG_PRINT("ERROR: secure area not correctly decrypted:");
            for (size_t i = 0; i < 8; i++)
                DEBUG_PRINTF(" %02x", secure_area_page._u8[i]);
            DEBUG_PRINT("\r\n");
        } else {
            secure_area_page._u32[0] = 0xE7FFDEFF;
            secure_area_page._u32[1] = 0xE7FFDEFF;
        }

        key1_init_keycode(nds_cart_state.game_code, 2, 8, false);
    }

    memcpy(data, secure_area_page._u8, sizeof(secure_area_page._u8));
}

/*
 * KEY1 encryption stuff
 */
s_blowfish_t blowfish_buf = {0};

static void key1_encrypt_64bit(uint32_t *data)
{
    uint32_t y = data[0];
    uint32_t x = data[1];

    for (int i = 0; i <= 15; i++) {
        uint32_t z = blowfish_buf.P[i] ^ x;
        x = blowfish_buf.S[0][(z >> 24) & 0xFF];
        x = blowfish_buf.S[1][(z >> 16) & 0xFF] + x;
        x = blowfish_buf.S[2][(z >> 8) & 0xFF] ^ x;
        x = blowfish_buf.S[3][(z >> 0) & 0xFF] + x;
        x = y ^ x;
        y = z;
    }

