CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
    data[0] = x ^ blowfish_buf.P[16];
    data[1] = y ^ blowfish_buf.P[17];
}

static void key1_decrypt_64bit(uint32_t *data)
{
    uint32_t y = data[0];
    uint32_t x = data[1];

    for (int i = 17; i >= 2; i--) {
        uint32_t z = blowfish_buf.P[i] ^ x;
        x = blowfish_buf.S[0][(z >> 24) & 0xFF];
        x = blowfish_buf.S[1][(z >> 16) & 0xFF] + x;
        x = blowfish_buf.S[2][(z >> 8) & 0xFF] ^ x;
        x = blowfish_buf.S[3][(z >> 0) & 0xFF] + x;
        x = y ^ x;
        y = z;
    }

    data[0] = x ^ blowfish_buf.P[1];
    data[1] = y ^ blowfish_buf.P[0];
}

static uint64_t key1_encrypt_cmd(uint64_t cmd)
{
    union {
        uint32_t _u32[2];
        uint64_t _u64;
    } u;

    u._u64 = cmd;
    key1_encrypt_64bit(u._u32);
    return u._u64;
}

static uint64_t key1_decrypt_cmd(uint64_t cmd)
{
    union {
        uint32_t _u32[2];
        uint64_t _u64;
    } u;

    u._u64 = cmd;
    key1_decrypt_64bit(u._u32);
    return u._u64;
}

static void key1_apply_keycode(uint32_t *keycode, uint32_t modulo)
{
    uint32_t scratch[2];
    scratch[0] = scratch[1] = 0;

    key1_encrypt_64bit(&keycode[1]);
    key1_encrypt_64bit(&keycode[0]);

    for (uint32_t i = 0; i < 18; i++) {
        blowfish_buf.P[i] ^= __builtin_bswap32(keycode[i % (modulo / 4u)]);
    }

    for (uint32_t i = 0; i < 18; i += 2) {
        key1_encrypt_64bit(scratch);
        blowfish_buf.P[i+0] = scratch[1];
        blowfish_buf.P[i+1] = scratch[0];
    }

    for (uint32_t i = 0; i < 4; i++) {
        for (uint32_t j = 0; j < 256; j += 2) {
            key1_encrypt_64bit(scratch);
            blowfish_buf.S[i][j+0] = scratch[1];
            blowfish_buf.S[i][j+1] = scratch[0];
        }
    }
}

static void key1_init_keycode(uint32_t idcode, uint32_t level, uint32_t modulo, bool dsi)
{
    uint32_t keycode[3];

//    DEBUG_PRINTF("key1_init_keycode: %c%c%c%c\r\n", idcode >> 0, idcode >> 8, idcode >> 16, idcode >> 24);

    if (dsi)
        memcpy(&blowfish_buf, dsi_cart_key, sizeof(blowfish_buf));
    else
        memcpy(&blowfish_buf, nds_cart_key, sizeof(blowfish_buf));

//    PRINT_KEY_BUFFER("unmodified", &blowfish_buf); // 'should output 99 D5 20 5F ...

    keycode[0] = idcode;
    keycode[1] = idcode / 2;
    keycode[2] = idcode * 2;

    if (level >= 1)
        key1_apply_keycode(keycode, modulo);
//    if (level >= 1)
//        PRINT_KEY_BUFFER("level 1", &blowfish_buf); // 'AMCP' level 1 --> should output 2B 8E 67 BB ...
    if (level >= 2)
        key1_apply_keycode(keycode, modulo);
//    if (level >= 2)
//        PRINT_KEY_BUFFER("level 2", &blowfish_buf); // 'AMCP' level 2 --> should output CD 9E F6 49 ...

    keycode[1] *= 2;
    keycode[2] /= 2;

    if (level >= 3)
        key1_apply_keycode(keycode, modulo);
//    if (level >= 3)
//        PRINT_KEY_BUFFER("level 3", &blowfish_buf); // 'AMCP' level 3 --> should output AF A9 F1 B7 ...
//    DEBUG_PRINT("end\r\n");
}

static void key2_init(bool hw_reset)
{
    if (hw_reset) {
        const uint64_t seed0 = 0x58C56DE0E8;
        const uint64_t seed1 = 0x5C879B9B05;

        nds_cart_state.key2_x = bitrev_64(seed0) >> (64 - 39);
        nds_cart_state.key2_y = bitrev_64(seed1) >> (64 - 39);

        return;
    }

    const uint64_t mmm = (uint64_t)(nds_cart_state.mmm & 0xFFF) << 27;
    const uint64_t nnn = (uint64_t)(nds_cart_state.nnn & 0xFFF) << 15;
    static const uint8_t seedbytes[8] = { 0xE8, 0x4D, 0x5A, 0xB1, 0x17, 0x8F, 0x99, 0xD5 };

    const uint64_t seed0 = (mmm | nnn) + 0x6000 + seedbytes[nds_cart_state.seed_byte % 8];
    const uint64_t seed1 = 0x5C879B9B05;

    // values have to be bit reversed at a length of 39 bits
    nds_cart_state.key2_x = bitrev_64(seed0) >> (64 - 39);
    nds_cart_state.key2_y = bitrev_64(seed1) >> (64 - 39);

//    DEBUG_PRINTF("initializing key2 mmm=%03llx nnn=%03llx seedbyte=%02x\r\n",
//        mmm, nnn, seedbytes[nds_cart_state.seed_byte % 8]
//    );
//    DEBUG_PRINTF("    => seed0=%010llx seed1=%010llx\r\n", seed0, seed1);
//    DEBUG_PRINTF("    => rev(seed0)=%010llx rev(seed1)=%010llx\r\n", bitrev_64(seed0), bitrev_64(seed1));
//    DEBUG_PRINTF("    => final(seed0)=%010llx final(seed1)=%010llx\r\n", bitrev_64(seed0) >> 25, bitrev_64(seed1) >> 25);
//    DEBUG_PRINTF("    => x=%010llx y=%010llx\r\n", nds_cart_state.key2_x, nds_cart_state.key2_y);
}

static void key2_xcrypt(uint8_t *data, size_t len)
{
    uint64_t x = nds_cart_state.key2_x;
    uint64_t y = nds_cart_state.key2_y;

    if (data) {
        for (size_t i = 0; i < len; i++) {
            x = (((x >> 5) ^ (x >> 17) ^ (x >> 18) ^ (x >> 31)) & 0xFF) + (x << 8);
            x &= 0x7FFFFFFFFF;
            y = (((y >> 5) ^ (y >> 23) ^ (y >> 18) ^ (y >> 31)) & 0xFF) + (y << 8);
            y &= 0x7FFFFFFFFF;
            data[i] = (uint8_t)(data[i] ^ x ^ y);
        }
    } else {
        for (size_t i = 0; i < len; i++) {
            x = (((x >> 5) ^ (x >> 17) ^ (x >> 18) ^ (x >> 31)) & 0xFF) + (x << 8);
            x &= 0x7FFFFFFFFF;
            y = (((y >> 5) ^ (y >> 23) ^ (y >> 18) ^ (y >> 31)) & 0xFF) + (y << 8);
            y &= 0x7FFFFFFFFF;
        }
    }

    nds_cart_state.key2_x = x;
    nds_cart_state.key2_y = y;
}

static uint64_t key2_encrypt_cmd(uint64_t cmd)
{
    // convert to big endian byte array
    uint8_t cmd_data[8];
#pragma GCC unroll 8
    for (size_t i = 0; i < 8; i++) {
        cmd_data[i] = (uint8_t)(cmd >> 56);
        cmd <<= 8;
    }

    key2_xcrypt(cmd_data, sizeof(cmd_data));

    // convert to number again
    cmd = 0;
#pragma GCC unroll 8
    for (size_t i = 0; i < 8; i++) {
        cmd <<= 8;
        cmd |= cmd_data[i];
    }
    return cmd;
}
